// Задача 7. Написать программу, которая принимает на вход трехзначное число, и на выходе показывает последнюю цифру этого числа
int N = 258;
N %= 10; //краткая запись от N = N % 10;
Console.WriteLine(N);

