// Задача 7. Написать программу, которая принимает на вход трехзначное число, и на выходе показывает последнюю цифру этого числа
int N = 456;
int D = N%10;
Console.WriteLine(D);

